fonecmid-diplom/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/ВКМ_МассовоеСозданиеАктов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ВКМ_МассовоеСозданиеАктов</name>
  <attributes>
    <name>ВКМ_Период</name>
    <type>
      <types>StandardPeriod</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВКМ_СписокДоговоров</name>
    <attributes>
      <name>Договор</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>ВКМ_СсылкаНаРеализацию</name>
      <type>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

fonecmid-diplom/src/InformationRegisters/ВКМ_АвтоматическиЗаполненныеДокументы/ВКМ_АвтоматическиЗаполненныеДокументы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВКМ_АвтоматическиЗаполненныеДокументы</name>
  <dimensions>
    <name>Реализация</name>
    <type>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

fonecmid-diplom/src/Documents/РеализацияТоваровУслуг/РеализацияТоваровУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РеализацияТоваровУслуг</name>
  <registerRecords>AccumulationRegister.ОстаткиТоваров</registerRecords>
  <registerRecords>AccumulationRegister.ОбработкаЗаказов</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговорыКонтрагентов</name>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>EnumRef.ВидыДоговоровКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_НачалоДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СуммаАбонентскойПлаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СтоимостьЧасаРаботы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_КонецДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаСозданияДокумента</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
</mdclass:Catalog>

fonecmid-diplom/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

Функция СозданиеРеализации(ДатаНачала,ДатаКонца)Экспорт
	УстановитьПривилегированныйРежим(Истина);
	// 1. Получаем все договоры на период
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДоговорыКонтрагентов.ВКМ_ДатаСозданияДокумента КАК ВКМ_ДатаСозданияДокумента,
	|	ДоговорыКонтрагентов.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|ГДЕ
	|	ДоговорыКонтрагентов.ВКМ_ДатаСозданияДокумента МЕЖДУ &ДатаНачала И &ДатаКонца";
	
	Запрос.УстановитьПараметр("ДатаНачала",ДатаНачала);
	Запрос.УстановитьПараметр("ДатаКонца" ,ДатаКонца);
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	МассивДоговоров = Новый Массив; 
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		МассивДоговоров.Добавить(ВыборкаДетальныеЗаписи.Ссылка);
	КонецЦикла;

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РеализацияТоваровУслуг.Ссылка КАК Реализация,
	|	РеализацияТоваровУслуг.Договор.Ссылка КАК Договор
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|ГДЕ
	|	РеализацияТоваровУслуг.Договор.Ссылка В(&МассивДоговоров)";
	
	Запрос.УстановитьПараметр("МассивДоговоров", МассивДоговоров);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	// 3. Создаём хэш-таблицу (ключ — договор, значение — реализация)
	ХэшТаблицаРеализаций = Новый Массив; 
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл 
		Запись = Новый Структура;
		Запись.Вставить("Договор",ВыборкаДетальныеЗаписи.Договор);
		Запись.Вставить("Реализация",ВыборкаДетальныеЗаписи.Реализация);
		ХэшТаблицаРеализаций.Добавить(Запись);
	КонецЦикла;  
	
	// 4. Создаём недостающие реализации
	Сч = 0; 
	Записанные = 0;
	Проведенные = 0;
	КоличествоДоговоров = МассивДоговоров.Количество();
	Для Каждого Договор Из МассивДоговоров Цикл
		Сч = Сч+1;
		Найдено = Ложь;
		Для Каждого Запись Из ХэшТаблицаРеализаций Цикл
			Если Запись.Договор = Договор Тогда
				Найдено = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		Если Не Найдено Тогда
			// Создаем новую реализацию
			НоваяРеализация = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
			НоваяРеализация.Дата = ТекущаяДатаСеанса();
			НоваяРеализация.Договор = Договор;
			НоваяРеализация.Контрагент = Договор.Владелец;
			НоваяРеализация.Организация = Договор.Организация;
			НоваяРеализация.Записать();
			СсылкаРеал = НоваяРеализация.Ссылка;
			НоваяРеализация.ОбработкаЗаполнения(СсылкаРеал,,Истина);
			НоваяРеализация.ВКМ_ВыполнитьАвтозаполнение();
			РезультатПроверки = СтандартныйМеханизмПроверкиЗаполнения(Договор);
			Если РезультатПроверки Тогда
				НоваяРеализация.Записать(РежимЗаписиДокумента.Проведение,РежимПроведенияДокумента.Оперативный);
				Проведенные = Проведенные + 1;
			Иначе 
				Записанные = Записанные + 1;
			КонецЕсли;
			
			//Создаем запись в регистре записей
			МенеджерЗаписи = РегистрыСведений.ВКМ_АвтоматическиЗаполненныеДокументы.СоздатьМенеджерЗаписи();
			МенеджерЗаписи.Договор = Договор; 
			МенеджерЗаписи.Реализация = СсылкаРеал;
			МенеджерЗаписи.Записать();
		КонецЕсли;
		ДлительныеОперации.СообщитьПрогресс(Сч /КоличествоДоговоров *100);	
	КонецЦикла; 
		
	СтрокаСообщения = СтрШаблон("Всего создано реализаций: %1%2Проведено:%3%4Записано:%5"
												,Проведенные+Записанные,Символы.ПС,Проведенные,Символы.ПС,Записанные);
    Возврат СтрокаСообщения;
	УстановитьПривилегированныйРежим(Ложь);
КонецФункции

Функция СтандартныйМеханизмПроверкиЗаполнения(Договор)
	Если Договор.Владелец <> Неопределено И Договор.Организация <> Неопределено Тогда
		Возврат Истина;
	Иначе 
		Возврат Ложь;
	КонецЕсли;
КонецФункции
#КонецОбласти
